Public Attributes | List of all members
API_AnalyticalLink_Rotation Struct Reference
Analytical Model
Contains the Structural Analytical Model Analytical Link Rotation values. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalRigidityType  | kxxType
Rigidity type in X direction.
 double  | kxxValue
Rigidity value in X direction.
 API_AnalyticalRigidityType  | kyyType
Rigidity type in Y direction.
 double  | kyyValue
Rigidity value in Y direction.
 API_AnalyticalRigidityType  | kzzType
Rigidity type in Z direction.
 double  | kzzValue
Rigidity value in Z direction.
 bool  | resistanceMx
Resistance value along the X axis.
 bool  | resistanceMy
Resistance value along the Y axis.
 bool  | resistanceMz
Resistance value along the Z axis.
 double  | mxValue
Rotation value in X direction.
 double  | myValue
Rotation value in Y direction.
 double  | mzValue
Rotation value in Z direction.
Detailed Description
Contains the Structural Analytical Model Analytical Link Rotation values.
Since
Archicad 25